{
  "other": [
    {
      "key": "o0",
      "primary": true,
      "title": "Teaching Assistant",
      "location": "App Design and Development",
      "date": "Spring 17",
      "responsibilities": [
        {
          "key": "o0_0",
          "content": "- Worked as a TA for the sophomore Information Systems course",
          "className": ""
        },
        {
          "key": "o0_1",
          "content": "- Graded exams and projects, while also running weekly labs to help up",
          "className": ""
        },
        {
          "key": "o0_2",
          "content": "to 20 sophomores improve their web application development skills",
          "className": "indent"
        }
      ],
      "fullContent":{
        "fullTitle": "Teaching Assistant",
        "content": {
          "client": "Carnegie Mellon University",
          "location": "Pittsburgh, PA",
          "link": "http://67272.cmuis.net/",
          "text": "As an Information Systems major, we are required to take 67-272: App Design and Development our sophomore year.  It is a course that is focused on teaching IS students how to build web applications and it is first programming heavy course specifically for IS majors.\n\nBefore this course, I had my doubts about majoring in Information Systems. All of the computer science courses that I was taking had us building more and just doing things that I considered to be a lot more fun. But when I finally took this course with Prof. Heimann, I knew that this was the major for me. That’s why I was extremely excited when I was offered the chance to be a Teaching Assistant for this course.\n\nBeing a TA involved three main responsibilities: grading exams and projects, running labs, and proctoring exams. \n\nBefore I actually started working, I felt as if I didn’t know enough to actually teach these students. But after the first lab started, I realized that I knew way more than I thought I did about programming and helping students debug and understand their code. This is why the experience of being a TA was a major step for me in being a software developer.",
          "categories": [
            "desktop"
          ],
          "pictures": [
            {
              "title": "Landing Page",
              "category": "desktop",
              "src": "./images/work/272ta/ta-page.png"
            }
          ]
        }
      }
    },
    {
      "key": "o1",
      "primary": false,
      "title": "Study Abroad",
      "location": "TU Dresden",
      "date": "Spring 16",
      "responsibilities": [
        {
          "key": "o1_0",
          "content": "- Attended the Technische Universität Dresden",
          "className": ""
        },
        {
          "key": "o1_1",
          "content": "- Developed use of German in a classroom/group setting",
          "className": ""
        }
      ],
      "fullContent":{
        "fullTitle": "Study Abroad",
        "content": {
          "course": "Technische Universität Dresden",
          "location": "Dresden, Germany",
          "link": "https://tu-dresden.de/",
          "text": "Going into college, I knew that I wanted to study abroad, and the question was always “Where and when?” and never “if?”.  During my Junior fall, after searching for different schools in England and Germany, I sent out various inquiries and applications. The weekend before my spring semester was supposed to start at CMU, I found out that I had been accepted to study a semester of Wirtschaftsinformatik at the Technische Universität Dresden.\n\nMy parents and I were beyond excited, as my dad’s family is still all in Germany.  Not only would I get to study in his homeland, but also spend time with my extended family that I only see once or twice every five years.\n\nBeing in Germany for five months really allowed me to connect with my dad’s culture. Being able to wake up and go to a baker and get freshly baked hard rolls and buying bratwurst from vendors on the street was incredible. (I absolutely love German food). It was difficult adjusting to constantly speaking and thinking in German.  Early on, I found myself having headaches at the end of the day, but I quickly adjusted.\n\nOne of the hardest things I had to do was take a database programming course that was taught in German by a PHD student that loved to mumble.  The worst part was that the final exam was 100% of the grade, and that it was verbal, meaning that I had to meet up with a German CS professor and discuss theoretical programming ideas with him… entirely in German. It’s safe to say that the weeks before finals were the scariest of my life. I thought it’d be a good idea to take 7 courses, as only the credits transferred and not the grades, allowing me to get ahead on credits that I needed to graduate at CMU. But with a lot of studying, hard-work, and luck, I was able to pass all 7 courses with the grades necessary to have the credits transfer.\n\nThe biggest takeaway for me though, while I loved studying at TU Dresden, was how much I truly loved studying at Carnegie Mellon. While the stress culture is a hard barrier to get past, once I started learning for myself and the sake of learning, I knew that it was perfect school for me, and studying abroad was an experience that solidified that for me.",
          "categories": [
            "pictures"
          ],
          "pictures": [
            {
              "title": "",
              "category": "pictures",
              "src": "./images/other/tud/symbol.png"
            },
            {
              "title": "Andreas-Pfitzmann-Bau",
              "category": "pictures",
              "src": "./images/other/tud/apb.png"
            },
            {
              "title": "Beyer-Bau",
              "category": "pictures",
              "src": "./images/other/tud/bb.png"
            }
          ]
        }
      }
    },
    {
      "key": "o2",
      "primary": false,
      "title": "Technical Assistant",
      "location": "Center for Pain Control",
      "date": "Jan – Feb 16",
      "responsibilities": [
        {
          "key": "o2_0",
          "content": "- Deployed new computers to the network after a ransomware attack",
          "className": ""
        }
      ],
      "fullContent":{
        "fullTitle": "Technical Assisstant",
        "content": {
          "client": "Center for Pain Control",
          "location": "Wyomissing, PA",
          "link": "http://www.centerforpaincontrol.net/",
          "text": "Because universities in Germany have different semester timelines than here in America, I had a few months before flying to study abroad at TU Dresden. At the time, my dad needed some help setting up a few new computers and then connecting them to the server at his office. Therefore, I volunteered to help him out. I would leave with him in the mornings and spend the days working in his coworker’s office (she was out on vacation).\n\nThe work itself was simple enough, but it really helped me get a grasp of running IT at a small doctor’s practice. I was setting up about 10 computers, installing the specific software for their specific user’s needs, while also connecting them to the server/database that they had running out of the basement.\n\nWhile waiting for software to install (I’d be setting up 3-4 machines at any given time) I’d usually be asked for some IT help by the different employees in the office, so there was not too much downtime waiting for these installations to happen.\n\nAfter the machines were completed, I would set them up in their specific offices after the employees left, and then head to the back room to ensure that the Ethernet connecters were live to the specific ports. Overall, I worked here about 2-3 times a week for 3 weeks before everything was completed and operational.",
          "categories": [
            "pictures"
          ],
          "pictures": [
            {
              "title": "",
              "category": "pictures",
              "src": "./images/other/cfpc/office.png"
            },
            {
              "title": "",
              "category": "pictures",
              "src": "./images/other/cfpc/PostOp.png"
            },
            {
              "title": "",
              "category": "pictures",
              "src": "./images/other/cfpc/room.png"
            },
            {
              "title": "",
              "category": "pictures",
              "src": "./images/other/cfpc/postop2.png"
            },
            {
              "title": "",
              "category": "pictures",
              "src": "./images/other/cfpc/operate.png"
            }
          ]
        }
      }
    },
    {
      "key": "o3",
      "primary": false,
      "title": "Camp Counselor",
      "location": "Bear Creek Camp",
      "date": "Summers 14-16",
      "responsibilities": [
        {
          "key": "o3_0",
          "content": "- Managed groups of 10-20 children weekly at a stay-away camp",
          "className": ""
        },
        {
          "key": "o3_1",
          "content": "- Cultivated campers’ growth and teamwork skills through group building",
          "className": ""
        },
        {
          "key": "o3_2",
          "content": "activities, while teaching them about nature through hikes and games",
          "className": "indent"
        }
      ],
      "fullContent":{
        "fullTitle": "Camp Counselor",
        "content": {
          "client": "Bear Creek Camp",
          "location": "Bear Creek, PA",
          "link": "http://bearcreekcamp.org/",
          "text": "When I was 9 years old, I went to a sleep-away camp called Bear Creek Camp, and I have three distinct memories: I had a tick embedded in my head, I ended up getting lice, and I made a girl cry at the dance because I was too scared to dance with her. It’s safe to say that I didn’t go back.\n\nFast forwarding about a decade, my mom brings BCC up again because a new person is running the camp: a guy that my parents had met in Germany while he was touring with a band called Captive Free. The spring semester was coming to a close, and I needed a summer job, so I decided to apply and pretty soon I was hired.\n\nI worked as a camp counselor for 2 full summers (2014 and 2015). The responsibilities included being responsible for a different group of children every week between the ages of 8 and 18 for 8 weeks. This would also involve taking those children out into the woods at least once every week.\n\nIn 2016, I worked for the summer's two busiest weeks, immediately following studying abroad in Dresden.\nIn 2017, I worked for the summer's final week, immediately following working in Palau.\n\nMany interviewers ask me why I would choose to work at a summer camp over a summer internship, but I would easily make the same choice again. I learned a lot while working at BCC. It’s actually surprising that there is so much overlap between being a counselor and a project manager. You’re constantly on a schedule, while constantly handling twenty odd things coming at you at any given time. I really believe that if you can take twenty 10 year olds out into the woods and not only have them survive, but also have fun, then you can manage any project.",
          "categories": [
            "pictures"
          ],
          "pictures": [
            {
              "title": "Webpage",
              "category": "pictures",
              "src": "./images/work/bcc/website.png"
            },
            {
              "title": "Coworkers",
              "category": "pictures",
              "src": "./images/work/bcc/sylvia.png"
            },
            {
              "title": "Brave Little Toaster",
              "category": "pictures",
              "src": "./images/work/bcc/toaster.png"
            }
          ]
        }
      }
    },
    {
      "key": "o4",
      "primary": true,
      "title": "Mission Trips",
      "location": "Guatemala",
      "date": "Summers 2007-2009",
      "responsibilities": [
        {
          "key": "o4_0",
          "content": "- Provided medical aid, vacation bible school, and construction crews to",
          "className": ""
        },
        {
          "key": "o4_1",
          "content": "local families, schools, and orphanages",
          "className": "indent"
        }
      ],
      "fullContent":{
        "fullTitle": "Mission Trips",
        "content": {
          "location": "Antigua, Guatemala",
          "text": "When I was in middle school, I went on three week-long mission trips to Guatemala with my family and church. Throughout these trips, we had the chance to help with construction work, with projects ranging from building a slide for a school, to putting roofs on shelters and homes, to helping build the foundation for a church at an orphanage.  We had the chance to truly make a difference in the lives of people who needed our help.\n\nTrips like these really open your eyes to the scale of the world. While it is so large, it’s also paradoxically very small. If you never leave your home or town, I don’t think you could ever understand the amount of need there is in this world.\n\nI may have only been in middle school, but these trips served as a foundation for who I am today. I truly strive to work somewhere where I can believe in what I’m doing, while also having the chance to make a difference in the world, whether it be the company’s main goal or side projects that they have running. I want to be able to do good in this world, and work somewhere where I will not be compromising my morals.",
          "categories": [
            "pictures"
          ],
          "pictures": [
            {
              "title": "Construction",
              "category": "pictures",
              "src": "./images/other/mission/construction.png"
            },
            {
              "title": "Bending Metal Squares",
              "category": "pictures",
              "src": "./images/other/mission/squares.png"
            },
            {
              "title": "Laying Foundation",
              "category": "pictures",
              "src": "./images/other/mission/foundation.png"
            },
            {
              "title": "Lunch Break",
              "category": "pictures",
              "src": "./images/other/mission/lunch.png"
            },
            {
              "title": "Progress",
              "category": "pictures",
              "src": "./images/other/mission/slide.png"
            },
            {
              "title": "Previous Project",
              "category": "pictures",
              "src": "./images/other/mission/oldchurch.png"
            }
          ]
        }
      }
    }
  ]
}
